app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('sadasd', '335415135', '2018-05-25 08:34:18', '2018-05-25 08:34:18', '022e3b0d3a4862e5ec1de2c3e8bfe672.jpg', 'image/jpeg', 33668, '2018-05-25 08:34:17')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    respond_to do |format|
      if @post.update(post_params)