app/models/user.rb

INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `provider`, `uid`, `name`, `image_url`) VALUES ('nhat_phi_u10@yahoo.com', '$2a$11$sD82skxbFzcB2mzR0as3HO2e3w0tmQGUIjAI2oJvMrdpNJaVaie5K', '2018-05-25 08:44:08', '2018-05-25 08:44:08', 'facebook', '1382729701826569', 'Phạm Nhật Phi', 'http://graph.facebook.com/v2.10/1382729701826569/picture')
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "facebook"], ["uid", "1382729701826569"], ["LIMIT", 1]]
---
  def self.from_omniauth(auth)
  	where(provider: auth.provider, uid: auth.uid).first_or_create do |user|

SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nhat_phi_u10@yahoo.com"], ["LIMIT", 1]]
---
def self.new_with_session(params, session)
	super.tap do |user|
		if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
			user.email = data["email"] if user.email.blank?